import pymongo

client = pymongo.MongoClient('mongodb://localhost:27017/')
db = client.database45
db.stories.delete_many({})
db.stories.insert_many(
    [
        {'name': '爱洛公主的故事', 'learn': '那些像梦幻般的梦想，并不都是遥不可及，努力向梦想迈进，希望就在前方'},

        {'name': '罗马公主', 'learn': '短暂而珍贵的记忆也散发着一种遗憾美'},
        {'name': '骄傲的凯蒂猫', 'learn': '谁都不能没有朋友，好东西要和大家分享才是真正的快乐。'},
        {'name': '小黄鸭学游泳', 'learn': '不要轻言放弃'},
        {"name": '西西公主', 'learn': '人们常说“谋事在人，成事在天”，对于一些看似已经注定的坏事情我们不要丧失信心，积极地想办法，是一定可以改变的。'},
        {'name': '小脏猪与白天鹅', 'learn': '生活中要讲究卫生，做个健康的孩子'},
        {'name': '蛮横的小王子', 'learn': '做人应该谦逊有礼貌，不可骄傲自大'},
        {'name': '贝壳小鸟和大象', 'learn': '朋友间应该要互相分享快乐，这样才能一起面对困难'},
        {'name': '勇敢的小刺猬', 'learn': '只要你真诚的付出，就会获得朋友的接纳'},
        {'name': '忠实的约翰', 'learn': '诚实忠诚是高尚的品德'},
        {'name': '十二个懒汉', 'learn': '懒惰只会让你一无所获，只有勤劳的付出才能得到我们想要的'},

    ]
)
# 在下方写你的代码：找到标签name包含‘公主’的所有文档并在控制台打印

