import pymongo

client = pymongo.MongoClient('mongodb://localhost:27017/')
db = client.garden
db.fruits.delete_many({})
db.fruits.insert_many(
    [
        {"name": "小明", "age": 10, "苹果": 30, "桃子": 25, "鸭梨": 8},
        {"name": "小利", "age": 9, "苹果": 40, "桃子": 25, "鸭梨": 14},
        {"name": "小美", "age": 10, "苹果": 6, "桃子": 37, "鸭梨": 7},
        {"name": "小严", "age": 8, "苹果": 17, "桃子": 20, "鸭梨": 26},
        {"name": "小童", "age": 10, "苹果": 27, "桃子": 10, "鸭梨": 20},
        {"name": "小军", "age": 8, "苹果": 9, "桃子": 6, "鸭梨": 10},
        {"name": "小诚", "age": 9, "苹果": 10, "桃子": 14, "鸭梨": 30},
        {"name": "小鑫", "age": 10, "苹果": 16, "桃子": 24, "鸭梨": 19},
        {"name": "小珠", "age": 9, "苹果": 9, "桃子": 8, "鸭梨": 18},
        {"name": "小红", "age": 8, "苹果": 29, "桃子": 20, "鸭梨": 13}
    ]
)
# 在下方写你的代码：查询采摘桃子数量小于25的学生
print(list(db.fruits.find({"桃子": {"$lt": 25}})))



