import pymongo

client = pymongo.MongoClient('mongodb://localhost:27017/')
db = client.database41
if not db.scores.find_one():
    db.scores.insert_many(
        [
            {"name": "李明", "age": 10, "语文": 90, "数学": 80, "英语": 89},
            {"name": "刘利", "age": 9, "语文": 80, "数学": 75, "英语": 84},
            {"name": "张美", "age": 10, "语文": 60, "数学": 77, "英语": 70},
            {"name": "王严", "age": 8, "语文": 78, "数学": 90, "英语": 76},
            {"name": "周明", "age": 10, "语文": 87, "数学": 100, "英语": 70},
            {"name": "赵军", "age": 8, "语文": 98, "数学": 69, "英语": 100},
            {"name": "孙诚", "age": 9, "语文": 100, "数学": 94, "英语": 90},
            {"name": "钱鑫", "age": 10, "语文": 96, "数学": 84, "英语": 99},
            {"name": "朱珠", "age": 9, "语文": 97, "数学": 88, "英语": 78},
            {"name": "鲁红", "age": 8, "语文": 79, "数学": 70, "英语": 93}
        ]
    )
# 在下方写你的代码：查询语文成绩大于90的学生
print(list(db.scores.find({"语文": {"$gt":90}})))



